# Lab | Data Cleaning and Formatting

In this lab, we will be working with the customer data from an insurance company, which can be found in the CSV file located at the following link: https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

# Challenge 1: Data Cleaning and Formatting

## Exercise 1: Cleaning Column Names

To ensure consistency and ease of use, standardize the column names of the dataframe. Start by taking a first look at the dataframe and identifying any column names that need to be modified. Use appropriate naming conventions and make sure that column names are descriptive and informative.

*Hint*:
- *Column names should be in lower case*
- *White spaces in column names should be replaced by `_`*
- *`st` could be replaced for `state`*

In [2]:
import pandas as pd

In [3]:
url = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv"

In [4]:
df = pd.read_csv(url)
df

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
4003,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4004,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4005,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4006,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4007,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [5]:
df.columns = [col.lower().replace(' ', '_') for col in df.columns]
df.rename(columns={'st': 'state'}, inplace=True)

In [6]:
df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

## Exercise 2: Cleaning invalid Values

The dataset contains columns with inconsistent and incorrect values that could affect the accuracy of our analysis. Therefore, we need to clean these columns to ensure that they only contain valid data.

Note that this exercise will focus only on cleaning inconsistent values and will not involve handling null values (NaN or None).

*Hint*:
- *Gender column contains various inconsistent values such as "F", "M", "Femal", "Male", "female", which need to be standardized, for example, to "M" and "F".*
- *State abbreviations be can replaced with its full name, for example "AZ": "Arizona", "Cali": "California", "WA": "Washington"*
- *In education, "Bachelors" could be replaced by "Bachelor"*
- *In Customer Lifetime Value, delete the `%` character*
- *In vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" could be replaced by "Luxury"*

In [7]:
df['gender'].value_counts()

gender
F         457
M         413
Male       39
female     28
Femal      17
Name: count, dtype: int64

In [8]:
gender_map = ({'F': 'F', 'M': 'M', 'Male': 'M', 'female': 'F', 'Femal': 'F'})
df['gender'] = df['gender'].map(gender_map)
df['gender'].value_counts()

gender
F    502
M    452
Name: count, dtype: int64

In [9]:
df['state'].value_counts()

state
Oregon        320
California    211
Arizona       186
Cali          120
Nevada         98
Washington     81
WA             30
AZ             25
Name: count, dtype: int64

In [10]:
df['state'] = df ['state'].map({'Oregon': 'Oregon',
                                'California': 'California',
                                'Arizona': 'Arizona',
                                'Cali': 'California',
                                'Nevada' : 'Nevada',
                                'Washington': 'Washington',
                                'WA' : 'Washington',
                                'AZ': 'Arizona'})
df['state'].value_counts()

state
California    331
Oregon        320
Arizona       211
Washington    111
Nevada         98
Name: count, dtype: int64

In [11]:
df['education'].value_counts()

education
Bachelor                324
College                 313
High School or Below    296
Master                   94
Doctor                   37
Bachelors                 7
Name: count, dtype: int64

In [12]:
df['education'] = df ['education'].map({'Bachelor' : 'Bachelor',
                                        'College' : 'College',
                                        'High School or Below' : 'High School or Below',
                                        'Master' : 'Master',
                                        'Doctor' : 'Doctor',
                                        'Bachelors' : 'Bachelor'})
df['education'].value_counts()

education
Bachelor                331
College                 313
High School or Below    296
Master                   94
Doctor                   37
Name: count, dtype: int64

In [13]:
df['customer_lifetime_value'] = df['customer_lifetime_value'].str.replace('%', '')

In [14]:
df['vehicle_class'].value_counts()

vehicle_class
Four-Door Car    576
Two-Door Car     205
SUV              199
Sports Car        57
Luxury SUV        20
Luxury Car        14
Name: count, dtype: int64

In [15]:
df['vehicle_class'] = df ['vehicle_class'].map({'Four-Door Car' : 'Four-Door',
                                                'Two-Door Car' : 'Two-Door',
                                                'SUV' : 'SUV',
                                                'Sports Car' : 'Luxury',
                                                'Luxury SUV' : 'Luxury',
                                                'Luxury Car' : 'Luxury' })
df['vehicle_class'].value_counts()

vehicle_class
Four-Door    576
Two-Door     205
SUV          199
Luxury        91
Name: count, dtype: int64

## Exercise 3: Formatting data types

The data types of many columns in the dataset appear to be incorrect. This could impact the accuracy of our analysis. To ensure accurate analysis, we need to correct the data types of these columns. Please update the data types of the columns as appropriate.

It is important to note that this exercise does not involve handling null values (NaN or None).

*Hint*:
- *Customer lifetime value should be numeric*
- *Number of open complaints has an incorrect format. Look at the different values it takes with `unique()` and take the middle value. As an example, 1/5/00 should be 5. Number of open complaints is a string - remember you can use `split()` to deal with it and take the number you need. Finally, since it should be numeric, cast the column to be in its proper type.*

In [16]:
df['customer_lifetime_value'] = pd.to_numeric(df['customer_lifetime_value'], errors='coerce')

clv_mean = df['customer_lifetime_value'].mean()
df['customer_lifetime_value'] = df['customer_lifetime_value'].fillna(clv_mean)

print(df['customer_lifetime_value'].head())
print(df['customer_lifetime_value'].dtype)

0    7.936903e+05
1    6.979536e+05
2    1.288743e+06
3    7.645862e+05
4    5.363077e+05
Name: customer_lifetime_value, dtype: float64
float64

In [17]:
df['number_of_open_complaints'] = df['number_of_open_complaints'].fillna('0/0/0')

df['number_of_open_complaints'] = df['number_of_open_complaints'].apply(lambda x: x.split('/')[1])

df['number_of_open_complaints'] = pd.to_numeric(df['number_of_open_complaints'])

print(df['number_of_open_complaints'].unique())
print(df['number_of_open_complaints'].dtype)

[0 2 1 3 5 4]
int64

## Exercise 4: Dealing with Null values

Identify any columns with null or missing values. Identify how many null values each column has. You can use the `isnull()` function in pandas to find columns with null values.

Decide on a strategy for handling the null values. There are several options, including:

- Drop the rows or columns with null values
- Fill the null values with a specific value (such as the column mean or median for numerical variables, and mode for categorical variables)
- Fill the null values with the previous or next value in the column
- Fill the null values based on a more complex algorithm or model (note: we haven't covered this yet)

Implement your chosen strategy to handle the null values. You can use the `fillna()` function in pandas to fill null values or `dropna()` function to drop null values.

Verify that your strategy has successfully handled the null values. You can use the `isnull()` function again to check if there are still null values in the dataset.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling null values.

After formatting data types, as a last step, convert all the numeric variables to integers.

In [18]:
df.isnull().sum()

customer                     2937
state                        2937
gender                       3054
education                    2937
customer_lifetime_value         0
income                       2937
monthly_premium_auto         2937
number_of_open_complaints       0
policy_type                  2937
vehicle_class                2937
total_claim_amount           2937
dtype: int64

In [19]:
#dropping rows that are all empty

df.dropna(how='all', inplace=True)

In [20]:
#calculating the mode of the gender column
gender_mode = df['gender'].mode()[0]

# Fill NaN values in 'gender' with the mode
df['gender'].fillna(gender_mode, inplace=True)

/var/folders/6p/v1z8hsjn4rgggm7qtz1wkbyr0000gn/T/ipykernel_1449/2430341336.py:5: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['gender'].fillna(gender_mode, inplace=True)

In [21]:
#calculating the median of the income column
income_median = df['income'].median()

# Fill NaN values in 'income' with the median
df['income'].fillna(income_median, inplace=True)

/var/folders/6p/v1z8hsjn4rgggm7qtz1wkbyr0000gn/T/ipykernel_1449/208514523.py:5: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['income'].fillna(income_median, inplace=True)

In [22]:
#calculating the mean of the monthly_premium_auto column
premium_mean = df['monthly_premium_auto'].mean()

# Fill NaN values with the mean
df['monthly_premium_auto'].fillna(premium_mean, inplace=True)

/var/folders/6p/v1z8hsjn4rgggm7qtz1wkbyr0000gn/T/ipykernel_1449/1958465419.py:5: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['monthly_premium_auto'].fillna(premium_mean, inplace=True)

In [23]:
df.isnull().sum()

customer                     2937
state                        2937
gender                          0
education                    2937
customer_lifetime_value         0
income                          0
monthly_premium_auto            0
number_of_open_complaints       0
policy_type                  2937
vehicle_class                2937
total_claim_amount           2937
dtype: int64

In [24]:
df.dropna(inplace=True)

In [25]:
df.isnull().sum()

customer                     0
state                        0
gender                       0
education                    0
customer_lifetime_value      0
income                       0
monthly_premium_auto         0
number_of_open_complaints    0
policy_type                  0
vehicle_class                0
total_claim_amount           0
dtype: int64

In [26]:
#getting a list of all columns with numeric data types
numeric_cols = df.select_dtypes(include='number').columns

#loop through the numeric columns and convert them to integer type
for col in numeric_cols:
    df[col] = df[col].astype(int)

# Check the data types to confirm the change
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1071 entries, 0 to 1070
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   customer                   1071 non-null   object
 1   state                      1071 non-null   object
 2   gender                     1071 non-null   object
 3   education                  1071 non-null   object
 4   customer_lifetime_value    1071 non-null   int64
 5   income                     1071 non-null   int64
 6   monthly_premium_auto       1071 non-null   int64
 7   number_of_open_complaints  1071 non-null   int64
 8   policy_type                1071 non-null   object
 9   vehicle_class              1071 non-null   object
 10  total_claim_amount         1071 non-null   int64
dtypes: int64(5), object(6)
memory usage: 100.4+ KB

## Exercise 5: Dealing with duplicates

Use the `.duplicated()` method to identify any duplicate rows in the dataframe.

Decide on a strategy for handling the duplicates. Options include:
- Dropping all duplicate rows
- Keeping only the first occurrence of each duplicated row
- Keeping only the last occurrence of each duplicated row
- Dropping duplicates based on a subset of columns
- Dropping duplicates based on a specific column

Implement your chosen strategy using the `drop_duplicates()` function.

Verify that your strategy has successfully handled the duplicates by checking for duplicates again using `.duplicated()`.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling duplicates.

Save the cleaned dataset to a new CSV file.

*Hint*: *after dropping duplicates, reset the index to ensure consistency*.

In [27]:
duplicate_count = df.duplicated().sum()
print(f"There are {duplicate_count} duplicate rows in the DataFrame.")

There are 0 duplicate rows in the DataFrame.

In [28]:
df.drop_duplicates(inplace=True)

df.reset_index(drop=True, inplace=True)

In [29]:
duplicate_count_after = df.duplicated().sum()
print(f"Number of duplicate rows after cleaning: {duplicate_count_after}")

Number of duplicate rows after cleaning: 0

In [30]:
# Save the cleaned DataFrame to a new CSV file
df.to_csv('customers_cleaned.csv', index=False)

print("Cleaned data has been successfully saved to 'customers_cleaned.csv'")

Cleaned data has been successfully saved to 'customers_cleaned.csv'

# Bonus: Challenge 2: creating functions on a separate `py` file

Put all the data cleaning and formatting steps into functions, and create a main function that performs all the cleaning and formatting.

Write these functions in separate .py file(s). By putting these steps into functions, we can make the code more modular and easier to maintain.

*Hint: autoreload module is a utility module in Python that allows you to automatically reload modules in the current session when changes are made to the source code. This can be useful in situations where you are actively developing code and want to see the effects of changes you make without having to constantly restart the Python interpreter or Jupyter Notebook kernel.*

In [31]:
# Magic commands
%load_ext autoreload
%autoreload 2

# Import main functions from .py file
from cleaning_functions import clean_customer_data

# Load the original, raw data
url = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv"
raw_df = pd.read_csv(url)

# Run the entire cleaning process with just one line of code
cleaned_df = clean_customer_data(raw_df.copy()) # Use .copy() to keep the original raw_df unchanged

# Work with perfectly cleaned data
cleaned_df.head()

Data cleaning and formatting complete.

/Users/ruibraz/Ironhack/Python/lab-dw-data-cleaning-and-formatting/cleaning_functions.py:34: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['gender'].fillna(df['gender'].mode()[0], inplace=True)
/Users/ruibraz/Ironhack/Python/lab-dw-data-cleaning-and-formatting/cleaning_functions.py:37: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['customer_lifetime_value'].fillna(df['customer_lifetime_value'].mean(), inplace=True)
/Users/ruibraz/Ironhack/Python/lab-dw-data-cleaning-and-formatting/cleaning_functions.py:38: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['income'].fillna(df['income'].median(), inplace=True)
/Users/ruibraz/Ironhack/Python/lab-dw-data-cleaning-and-formatting/cleaning_functions.py:39: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['monthly_premium_auto'].fillna(df['monthly_premium_auto'].mean(), inplace=True)

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,F,Master,793690,0,1000,0,Personal Auto,Four-Door Car,2
1,QZ44356,Arizona,F,Bachelor,697953,0,94,0,Personal Auto,Four-Door Car,1131
2,AI49188,Nevada,F,Bachelor,1288743,48767,108,0,Personal Auto,Two-Door Car,566
3,WW63253,California,M,Bachelor,764586,0,106,0,Corporate Auto,SUV,529
4,GA49547,Washington,M,High School or Below,536307,36357,68,0,Personal Auto,Four-Door Car,17

# Bonus: Challenge 3: Analyzing Clean and Formated Data

You have been tasked with analyzing the data to identify potential areas for improving customer retention and profitability. Your goal is to identify customers with a high policy claim amount and a low customer lifetime value.

In the Pandas Lab, we only looked at high policy claim amounts because we couldn't look into low customer lifetime values. If we had tried to work with that column, we wouldn't have been able to because customer lifetime value wasn't clean and in its proper format. So after cleaning and formatting the data, let's get some more interesting insights!

Instructions:

- Review the statistics again for total claim amount and customer lifetime value to gain an understanding of the data.
- To identify potential areas for improving customer retention and profitability, we want to focus on customers with a high policy claim amount and a low customer lifetime value. Consider customers with a high policy claim amount to be those in the top 25% of the total claim amount, and clients with a low customer lifetime value to be those in the bottom 25% of the customer lifetime value. Create a pandas DataFrame object that contains information about customers with a policy claim amount greater than the 75th percentile and a customer lifetime value in the bottom 25th percentile.
- Use DataFrame methods to calculate summary statistics about the high policy claim amount and low customer lifetime value data. To do so, select both columns of the dataframe simultaneously and pass it to the `.describe()` method. This will give you descriptive statistics, such as mean, median, standard deviation, minimum and maximum values for both columns at the same time, allowing you to compare and analyze their characteristics.

In [32]:
# Select both columns and get their summary statistics
df[['total_claim_amount', 'customer_lifetime_value']].describe()

       total_claim_amount  customer_lifetime_value
count         1071.000000             1.071000e+03
mean           404.528478             7.936898e+05
std            293.041850             6.425757e+05
min              0.000000             2.004350e+05
25%            201.500000             4.048530e+05
50%            354.000000             5.887180e+05
75%            532.000000             8.945205e+05
max           2893.000000             5.816655e+06

In [33]:
# Get the threshold values from our description
high_claim_threshold = df['total_claim_amount'].quantile(0.75)
low_clv_threshold = df['customer_lifetime_value'].quantile(0.25)

# Create the two boolean conditions
high_claim_condition = df['total_claim_amount'] > high_claim_threshold
low_clv_condition = df['customer_lifetime_value'] < low_clv_threshold

# Filter the DataFrame to find customers who meet BOTH conditions
high_risk_customers_df = df[high_claim_condition & low_clv_condition]

# Display the first few rows of this new DataFrame
high_risk_customers_df.head()

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
17,OE15005,California,F,College,394524,28855,101,0,Personal Auto,SUV,647
23,TZ98966,Nevada,F,Bachelor,245019,0,73,3,Corporate Auto,Four-Door,554
26,US89481,California,F,Bachelor,394637,0,111,0,Personal Auto,Four-Door,799
38,CM61827,Oregon,F,Bachelor,309003,0,90,0,Personal Auto,Two-Door,648
42,IL19217,California,F,Bachelor,393900,60021,99,0,Personal Auto,Four-Door,882

In [34]:
# Calculate and display summary statistics for the target segment
print("Statistics for High-Risk, Low-Value Customers:")
high_risk_customers_df[['total_claim_amount', 'customer_lifetime_value']].describe()

Statistics for High-Risk, Low-Value Customers:

       total_claim_amount  customer_lifetime_value
count           40.000000                40.000000
mean           723.300000            341577.425000
std            149.216449             56921.466178
min            537.000000            228759.000000
25%            632.750000            304220.500000
50%            685.000000            365995.000000
75%            799.000000            387364.000000
max           1185.000000            402381.000000